Моя_подготовка_БУДЗ3/src/Documents/Сборка/Сборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Сборка</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>СкладСписания</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокГотовойПродукции</name>
    <attributes>
      <name>ГотоваяПродукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Моя_подготовка_БУДЗ3/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

Моя_подготовка_БУДЗ3/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Деталь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Моя_подготовка_БУДЗ3/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.СвойстваНоменклатуры</types>
  </type>
  <predefined>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Свойство</name>
      <description>Свойство</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>Склад</name>
      <description>Склад</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Моя_подготовка_БУДЗ3/src/Documents/Сборка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Записать();
	
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	//ЭлементБлокировки.УстановитьЗначение("Качество", Справочники.Качество.НайтиПоКоду("1"));
	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//ЭлементБлокировки.ИсточникДанных = ДокументОбъект.ВозвратнаяТара;
	//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	//Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаСписокГотовойПродукции.ГотоваяПродукция КАК ГотоваяПродукция,
		|	СборкаСписокГотовойПродукции.Свойство КАК Свойство,
		|	СУММА(СборкаСписокГотовойПродукции.Количество) КАК КоличествоГотовойПродукции
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|	Документ.Сборка.СписокГотовойПродукции КАК СборкаСписокГотовойПродукции
		|ГДЕ
		|	СборкаСписокГотовойПродукции.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СборкаСписокГотовойПродукции.ГотоваяПродукция,
		|	СборкаСписокГотовойПродукции.Свойство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ГотоваяПродукция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДеталиНоменклатуры.Ссылка КАК ГотоваяПродукция,
		|	ДеталиНоменклатуры.Номенклатура КАК Деталь,
		|	ДеталиНоменклатуры.Количество КАК КоличествоДеталей
		|ПОМЕСТИТЬ ДеталиНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура.Комплектующие КАК ДеталиНоменклатуры
		|ГДЕ
		|	ДеталиНоменклатуры.Ссылка В
		|			(ВЫБРАТЬ
		|				Т.ГотоваяПродукция
		|			ИЗ
		|				ДанныеДокумента КАК Т)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.ГотоваяПродукция КАК ГотоваяПродукция,
		|	ДеталиНоменклатуры.Деталь КАК Деталь,
		|	СУММА(ЕСТЬNULL(ДеталиНоменклатуры.КоличествоДеталей, 0) * ДанныеДокумента.КоличествоГотовойПродукции) КАК ОбщееКоличествоНеобходимыхДеталей
		|ПОМЕСТИТЬ ОбщееКоличествоДеталейПоПродукции
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДеталиНоменклатуры КАК ДеталиНоменклатуры
		|		ПО ДанныеДокумента.ГотоваяПродукция = ДеталиНоменклатуры.ГотоваяПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.ГотоваяПродукция,
		|	ДеталиНоменклатуры.Деталь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.ГотоваяПродукция КАК ГотоваяПродукция,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеДокумента.ГотоваяПродукция) КАК ГотоваяПродукцияПредставление,
		|	ДанныеДокумента.Свойство КАК Свойство,
		|	ДанныеДокумента.КоличествоГотовойПродукции КАК КоличествоГотовойПродукции,
		|	ОбщееКоличествоДеталейПоПродукции.Деталь КАК Деталь,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОбщееКоличествоДеталейПоПродукции.Деталь) КАК ДетальПредставление,
		|	ОбщееКоличествоДеталейПоПродукции.ОбщееКоличествоНеобходимыхДеталей КАК ОбщееКоличествоНеобходимыхДеталей,
		|	ДанныеДокумента.КоличествоГотовойПродукции * ЕСТЬNULL(ДеталиНоменклатуры.КоличествоДеталей, 0) КАК КоличествоДеталейПоДокументу,
		|	ЕСТЬNULL(УправленческийОстатки.КоличествоОстатокДт, 0) КАК КоличествоОстатокДеталей,
		|	ЕСТЬNULL(УправленческийОстатки.СуммаОстатокДт, 0) КАК СуммаОстатокДеталей
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОбщееКоличествоДеталейПоПродукции КАК ОбщееКоличествоДеталейПоПродукции
		|		ПО ДанныеДокумента.ГотоваяПродукция = ОбщееКоличествоДеталейПоПродукции.ГотоваяПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДеталиНоменклатуры КАК ДеталиНоменклатуры
		|		ПО (ДеталиНоменклатуры.ГотоваяПродукция = ОбщееКоличествоДеталейПоПродукции.ГотоваяПродукция)
		|			И (ДеталиНоменклатуры.Деталь = ОбщееКоличествоДеталейПоПродукции.Деталь)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
		|				&МоментВремени,
		|				Счет = &СчетМатериалы,
		|				&Субконто,
		|				Субконто1 В
		|						(ВЫБРАТЬ
		|							Т.Деталь
		|						ИЗ
		|							ОбщееКоличествоДеталейПоПродукции КАК Т)
		|					И Субконто2 = &СкладСписания) КАК УправленческийОстатки
		|		ПО (ОбщееКоличествоДеталейПоПродукции.Деталь = (ВЫРАЗИТЬ(УправленческийОстатки.Субконто1 КАК Справочник.Номенклатура)))
		|ИТОГИ
		|	МАКСИМУМ(КоличествоГотовойПродукции)
		|ПО
		|	ГотоваяПродукция,
		|	Свойство";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("СкладСписания", СкладСписания);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетМатериалы", ПланыСчетов.Управленческий.Материалы);
	
	Субконто = Новый Массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склад);
	Запрос.УстановитьПараметр("Субконто", Субконто);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить(); // Для отладки.
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//ВыборкаДетальныеЗаписи = ГруппировкаПоДеталям.Выбрать();
		КоличествоНеобходимыхДеталей = ВыборкаДетальныеЗаписи.КоличествоНеобходимыхДеталей;
		КоличествоОстатокДеталей = ВыборкаДетальныеЗаписи.КоличествоОстатокДеталей;
		СуммаОстатокДеталей = ВыборкаДетальныеЗаписи.СуммаОстатокДеталей;
		
		Если КоличествоНеобходимыхДеталей > КоличествоОстатокДеталей Тогда
			Отказ = Истина;
			
			ПереченьДеталей = Новый Массив;
			ПереченьПродукции = Новый Массив;
			
			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	Если ПереченьДеталей.Найти(ВыборкаДетальныеЗаписи.ДетальПредставление) = Неопределено Тогда
			//		ПереченьДеталей.Добавить(ВыборкаДетальныеЗаписи.ДетальПредставление);
			//	КонецЕсли;
			//	
			//	Если ПереченьПродукции.Найти(ВыборкаДетальныеЗаписи.ГотоваяПродукцияПредставление) = Неопределено Тогда
			//		ПереченьПродукции.Добавить(ВыборкаДетальныеЗаписи.ГотоваяПродукцияПредставление);
			//	КонецЕсли;
			//КонецЦикла;
			
			ПереченьДеталейСтрокой = СтрСоединить(ПереченьДеталей, ", ");
			ПереченьПродукцииСтрокой = СтрСоединить(ПереченьПродукции, ", ");
			
			ШаблонСообщения = НСтр("ru = 'Для сборки продукции ""%1"" не хватает деталей ""%2"". Требуется: %3, остаток: %4'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения,
				ПереченьПродукцииСтрокой,
				ПереченьДеталейСтрокой,
				КоличествоНеобходимыхДеталей,
				КоличествоОстатокДеталей);
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		//СебестоимостьДеталей = ?(КоличествоОстатокДеталей = Движение.КоличествоКт,
		//	СуммаОстатокДеталей,
		//	СуммаОстатокДеталей / КоличествоОстатокДеталей * Движение.КоличествоКт);
		//
		//Движение = Движения.Управленческий.Добавить();
		//Движение.СчетДт = ПланыСчетов.Управленческий.ОсновноеПроизводство;
		//Движение.СчетКт = ПланыСчетов.Управленческий.Материалы;
		//Движение.Период = Дата;
		//Движение.КоличествоКт = КоличествоНеобходимыхДеталей;
		//Движение.Сумма = СебестоимостьДеталей;
		//Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Деталь;
		//Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = СкладСписания;
		
		//Движение = Движения.Управленческий.Добавить();
		//Движение.СчетДт = ПланыСчетов.Управленческий.Товары;
		//Движение.СчетКт = ПланыСчетов.Управленческий.ОсновноеПроизводство;
		//Движение.Период = Дата;
		//Движение.КоличествоДт = ТекСтрокаСписокГотовойПродукции.Количество;
		//Движение.Сумма = СебестоимостьДеталей;
		//Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаСписокГотовойПродукции.ГотоваяПродукция;
		//Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = СкладПоступления;
		//Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Свойство] = ТекСтрокаСписокГотовойПродукции.Свойство;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
